import pandas as pd

#створюємо датафрейм з даними.
data = {
    "Vitaly_Prikhodko": [12, 10, 9, 10, 5, 7, 8, 5, 12, 10],
    "Dmytro_Kropyvnytskyi": [12, 10, 9, 5, 6, 7, 4, 3, 12, 4],
    "Mikhail_Romanenko": [12, 3, 4, 6, 5, 5, 3, 7, 5, 4],
    "Maxim_Derizemlya": [12, 4, 10, 7, 5, 8, 3, 3, 5, 7],
    "Victoria_Zhuk": [10, 10, 10, 9, 10, 9, 10, 8, 7 , 12],
    "Andrey_Kuryanov": [5, 6, 7, 5, 4, 7, 5, 4, 4, 8],
    "Oksana_Dubovets": [7, 8, 5, 8, 8, 9, 8, 7, 7, 10],
    "Nikita_Stroganov": [6, 7, 8, 9, 10, 10 , 10, 10, 10 ,9],
    "Karina_Nikolaenko": [2, 3, 5, 4, 5, 4, 3, 3, 5 ,8]
}

df = pd.DataFrame(data)

#виводимо датафрейм.
print("Датафрейм:")
print(df)

#виконуємо агрегаційні операції для кожного студента.
print("\nАгрегаційні операції для кожного студента:")

#середнє значення оцінок для кожного студента.
print("Середні значення оцінок:")
print(df.mean())

#сума оцінок для кожного студента.
print("\nСума оцінок:")
print(df.sum())

#мінімальна оцінка для кожного студента.
print("\nМінімальні оцінки:")
print(df.min())

#максимальна оцінка для кожного студента.
print("\nМаксимальні оцінки:")
print(df.max())

#групування: наприклад, за умовними рівнями оцінок (низькі, середні, високі).
print("\nГрупування оцінок по категоріях (низькі, середні, високі):")
categories = pd.cut(df.values.flatten(), bins=[0, 5, 8, 12], labels=['Низькі', 'Середні', 'Високі'])
category_counts = pd.Series(categories).value_counts()
print(category_counts)